AplicacionTuLibroOnline/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ven="http://j2ee.netbeans.org/wsdl/ServiciosVenta/DescriptorBPEL/VentaLibrosWSDL">
  <soapenv:Body>
    <ven:VentaLibrosWSDLOperation>
      <ISBN>978-84-92650-17-1</ISBN>
      <idCliente>igpuebla</idCliente>
      <unidades>2</unidades>
      <precioUnidad>30</precioUnidad>
    </ven:VentaLibrosWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>